Revit 2027 API
FailuresAccessor.IsFailureResolutionPermitted(FailureMessageAccessor) Method
 Checks if default resolution of the failure is permitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFailureResolutionPermitted(
	FailureMessageAccessor failure
)
Public Function IsFailureResolutionPermitted (
	failure As FailureMessageAccessor
) As Boolean
public:
bool IsFailureResolutionPermitted(
	FailureMessageAccessor^ failure
)
member IsFailureResolutionPermitted :
        failure : FailureMessageAccessor -> bool
Parameters
failure FailureMessageAccessor
 The accessor to the failure to be resolved.
Return Value
Boolean
 True if default resolution of the failure is permitted
Exceptions
Exception | Condition
ArgumentException |  failure has not been properly initialized.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
IsFailureResolutionPermitted Overload
Autodesk.Revit.DB Namespace